{
  "_name_or_path": "nbroad/ESG-BERT",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-ENV_ENC_ECI",
    "1": "B-ENV_ENC_TEC",
    "2": "B-ENV_GHG_AE1",
    "3": "B-ENV_GHG_AE2",
    "4": "B-ENV_GHG_AE3",
    "5": "B-ENV_GHG_AET",
    "6": "B-ENV_GHG_EI",
    "7": "B-ENV_GHG_EIT",
    "8": "B-ENV_WAC_TWC",
    "9": "B-ENV_WAC_WCI",
    "10": "B-ENV_WAG_TWG",
    "11": "B-GOV_ALF_AFD",
    "12": "B-GOV_ASS_ASR",
    "13": "B-GOV_BOC_BIN",
    "14": "B-GOV_BOC_WOB",
    "15": "B-GOV_CER_LRC",
    "16": "B-GOV_ETB_ACD",
    "17": "B-GOV_ETB_ACT_N",
    "18": "B-GOV_ETB_ACT_P",
    "19": "B-GOV_MAD_WMT",
    "20": "B-SOC_AGD_CEA",
    "21": "B-SOC_AGD_NHI",
    "22": "B-SOC_AGD_TOR",
    "23": "B-SOC_DEV_ATH_F",
    "24": "B-SOC_DEV_ATH_M",
    "25": "B-SOC_GED_CEG_F",
    "26": "B-SOC_GED_CEG_M",
    "27": "B-SOC_GED_ETG",
    "28": "B-SOC_GED_NHG",
    "29": "B-SOC_OHS_FAT",
    "30": "B-SOC_OHS_HCI",
    "31": "B-SOC_OHS_REC",
    "32": "B-SOC_OHS_RWI",
    "33": "B-UNIT",
    "34": "B-VALUE",
    "35": "I-ENV_ENC_ECI",
    "36": "I-ENV_ENC_TEC",
    "37": "I-ENV_GHG_AE1",
    "38": "I-ENV_GHG_AE2",
    "39": "I-ENV_GHG_AE3",
    "40": "I-ENV_GHG_AET",
    "41": "I-ENV_GHG_EI",
    "42": "I-ENV_GHG_EIT",
    "43": "I-ENV_WAC_TWC",
    "44": "I-ENV_WAC_WCI",
    "45": "I-ENV_WAG_TWG",
    "46": "I-GOV_ALF_AFD",
    "47": "I-GOV_ASS_ASR",
    "48": "I-GOV_BOC_BIN",
    "49": "I-GOV_BOC_WOB",
    "50": "I-GOV_CER_LRC",
    "51": "I-GOV_ETB_ACD",
    "52": "I-GOV_ETB_ACT_N",
    "53": "I-GOV_ETB_ACT_P",
    "54": "I-GOV_MAD_WMT",
    "55": "I-SOC_AGD_CEA",
    "56": "I-SOC_AGD_NHI",
    "57": "I-SOC_AGD_TOR",
    "58": "I-SOC_DEV_ATH_F",
    "59": "I-SOC_DEV_ATH_M",
    "60": "I-SOC_GED_CEG_F",
    "61": "I-SOC_GED_CEG_M",
    "62": "I-SOC_GED_ETG",
    "63": "I-SOC_GED_NHG",
    "64": "I-SOC_OHS_FAT",
    "65": "I-SOC_OHS_HCI",
    "66": "I-SOC_OHS_REC",
    "67": "I-SOC_OHS_RWI",
    "68": "I-UNIT",
    "69": "I-VALUE",
    "70": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ENV_ENC_ECI": 0,
    "B-ENV_ENC_TEC": 1,
    "B-ENV_GHG_AE1": 2,
    "B-ENV_GHG_AE2": 3,
    "B-ENV_GHG_AE3": 4,
    "B-ENV_GHG_AET": 5,
    "B-ENV_GHG_EI": 6,
    "B-ENV_GHG_EIT": 7,
    "B-ENV_WAC_TWC": 8,
    "B-ENV_WAC_WCI": 9,
    "B-ENV_WAG_TWG": 10,
    "B-GOV_ALF_AFD": 11,
    "B-GOV_ASS_ASR": 12,
    "B-GOV_BOC_BIN": 13,
    "B-GOV_BOC_WOB": 14,
    "B-GOV_CER_LRC": 15,
    "B-GOV_ETB_ACD": 16,
    "B-GOV_ETB_ACT_N": 17,
    "B-GOV_ETB_ACT_P": 18,
    "B-GOV_MAD_WMT": 19,
    "B-SOC_AGD_CEA": 20,
    "B-SOC_AGD_NHI": 21,
    "B-SOC_AGD_TOR": 22,
    "B-SOC_DEV_ATH_F": 23,
    "B-SOC_DEV_ATH_M": 24,
    "B-SOC_GED_CEG_F": 25,
    "B-SOC_GED_CEG_M": 26,
    "B-SOC_GED_ETG": 27,
    "B-SOC_GED_NHG": 28,
    "B-SOC_OHS_FAT": 29,
    "B-SOC_OHS_HCI": 30,
    "B-SOC_OHS_REC": 31,
    "B-SOC_OHS_RWI": 32,
    "B-UNIT": 33,
    "B-VALUE": 34,
    "I-ENV_ENC_ECI": 35,
    "I-ENV_ENC_TEC": 36,
    "I-ENV_GHG_AE1": 37,
    "I-ENV_GHG_AE2": 38,
    "I-ENV_GHG_AE3": 39,
    "I-ENV_GHG_AET": 40,
    "I-ENV_GHG_EI": 41,
    "I-ENV_GHG_EIT": 42,
    "I-ENV_WAC_TWC": 43,
    "I-ENV_WAC_WCI": 44,
    "I-ENV_WAG_TWG": 45,
    "I-GOV_ALF_AFD": 46,
    "I-GOV_ASS_ASR": 47,
    "I-GOV_BOC_BIN": 48,
    "I-GOV_BOC_WOB": 49,
    "I-GOV_CER_LRC": 50,
    "I-GOV_ETB_ACD": 51,
    "I-GOV_ETB_ACT_N": 52,
    "I-GOV_ETB_ACT_P": 53,
    "I-GOV_MAD_WMT": 54,
    "I-SOC_AGD_CEA": 55,
    "I-SOC_AGD_NHI": 56,
    "I-SOC_AGD_TOR": 57,
    "I-SOC_DEV_ATH_F": 58,
    "I-SOC_DEV_ATH_M": 59,
    "I-SOC_GED_CEG_F": 60,
    "I-SOC_GED_CEG_M": 61,
    "I-SOC_GED_ETG": 62,
    "I-SOC_GED_NHG": 63,
    "I-SOC_OHS_FAT": 64,
    "I-SOC_OHS_HCI": 65,
    "I-SOC_OHS_REC": 66,
    "I-SOC_OHS_RWI": 67,
    "I-UNIT": 68,
    "I-VALUE": 69,
    "O": 70
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.44.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
